20210926103926-github.org
:PROPERTIES:
:ID:       6b889822-21f1-4a3e-9755-e3ca52fa0bc4
:END:
#+title: GitHub
* 概要
GitHubは[[id:90c6b715-9324-46ce-a354-63d09403b066][Git]]のコードホスティングサービス。
* Memo
** CODEOWNERS
.github/CODEOWNERSファイルを配置すると、特定のパターンで特定の人にレビュー必須にできる。
例えば.rbの変更が含まれていた場合は@backend-team、.tsの場合は@Aさん、など。
** コンテナレジストリ
DockerHubのように、[[id:1658782a-d331-464b-9fd7-1f8233b8b7f8][Docker]]コンテナをホストするサービスとして利用できる。

- GitHubトークンを発行する
- シェル上でログインする
- タグをつけてビルドする
- pushする

[[https://docs.github.com/ja/packages/working-with-a-github-packages-registry/working-with-the-container-registry][コンテナレジストリの利用 - GitHub Docs]]
** リポジトリで特定の言語をignoreするとき
リポジトリ内にライブラリなどが入っていると、GitHub上で意図しない言語のリポジトリとみなされることがある。
~.gitattributes~ ファイルを作って↓のように入力すると、public内のファイルが言語統計から無視される。
#+begin_src
public/* linguist-vendored
public/*/* linguist-vendored
#+end_src
* Tasks
** TODO [[https://www.oreilly.co.jp/books/9784873117959/][O'Reilly Japan - GitHubツールビルディング]]
:LOGBOOK:
CLOCK: [2022-09-25 Sun 15:02]--[2022-09-25 Sun 15:27] =>  0:25
CLOCK: [2022-09-25 Sun 14:21]--[2022-09-25 Sun 14:46] =>  0:25
:END:
GitHubでのメタツールの作り方を解説している。

- 条件付きリクエストはレートを消費しない。変更がない場合は何も返さない
* Reference
** [[https://docs.github.com/ja][GitHub Documentation]]
GitHubのドキュメント。
* Archives
