20210926103926-github.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-09-25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>GitHub</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">GitHub</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf3fabd8">概要</a></li>
<li><a href="#org733c8a7">Memo</a>
<ul>
<li><a href="#org397a139">CODEOWNERS</a></li>
<li><a href="#orgc9cda22">コンテナレジストリ</a></li>
<li><a href="#org2cb9e17">リポジトリで特定の言語をignoreするとき</a></li>
</ul>
</li>
<li><a href="#orgf572843">Tasks</a>
<ul>
<li><a href="#org39f7f5c"><span class="todo TODO">TODO</span> O&rsquo;Reilly Japan - GitHubツールビルディング</a></li>
</ul>
</li>
<li><a href="#org807515e">Reference</a>
<ul>
<li><a href="#org5d26551">GitHub Documentation</a></li>
</ul>
</li>
<li><a href="#org5e15c79">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf3fabd8" class="outline-2">
<h2 id="orgf3fabd8"><a href="#orgf3fabd8">概要</a></h2>
<div class="outline-text-2" id="text-orgf3fabd8">
<p>
GitHubは<a href="20210901104129-git.html#ID-90c6b715-9324-46ce-a354-63d09403b066">Git</a>のコードホスティングサービス。
</p>
</div>
</div>
<div id="outline-container-org733c8a7" class="outline-2">
<h2 id="org733c8a7"><a href="#org733c8a7">Memo</a></h2>
<div class="outline-text-2" id="text-org733c8a7">
</div>
<div id="outline-container-org397a139" class="outline-3">
<h3 id="org397a139"><a href="#org397a139">CODEOWNERS</a></h3>
<div class="outline-text-3" id="text-org397a139">
<p>
.github/CODEOWNERSファイルを配置すると、特定のパターンで特定の人にレビュー必須にできる。
例えば.rbの変更が含まれていた場合は@backend-team、.tsの場合は@Aさん、など。
</p>
</div>
</div>
<div id="outline-container-orgc9cda22" class="outline-3">
<h3 id="orgc9cda22"><a href="#orgc9cda22">コンテナレジストリ</a></h3>
<div class="outline-text-3" id="text-orgc9cda22">
<p>
DockerHubのように、<a href="20210805005543-docker.html#ID-1658782a-d331-464b-9fd7-1f8233b8b7f8">Docker</a>コンテナをホストするサービスとして利用できる。
</p>

<ul class="org-ul">
<li>GitHubトークンを発行する</li>
<li>シェル上でログインする</li>
<li>タグをつけてビルドする</li>
<li>pushする</li>
</ul>

<p>
<a href="https://docs.github.com/ja/packages/working-with-a-github-packages-registry/working-with-the-container-registry">コンテナレジストリの利用 - GitHub Docs</a>
</p>
</div>
</div>
<div id="outline-container-org2cb9e17" class="outline-3">
<h3 id="org2cb9e17"><a href="#org2cb9e17">リポジトリで特定の言語をignoreするとき</a></h3>
<div class="outline-text-3" id="text-org2cb9e17">
<p>
リポジトリ内にライブラリなどが入っていると、GitHub上で意図しない言語のリポジトリとみなされることがある。
<code>.gitattributes</code> ファイルを作って↓のように入力すると、public内のファイルが言語統計から無視される。
</p>
<pre class="example">
public/* linguist-vendored
public/*/* linguist-vendored
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf572843" class="outline-2">
<h2 id="orgf572843"><a href="#orgf572843">Tasks</a></h2>
<div class="outline-text-2" id="text-orgf572843">
</div>
<div id="outline-container-org39f7f5c" class="outline-3">
<h3 id="org39f7f5c"><a href="#org39f7f5c"><span class="todo TODO">TODO</span> <a href="https://www.oreilly.co.jp/books/9784873117959/">O&rsquo;Reilly Japan - GitHubツールビルディング</a></a></h3>
<div class="outline-text-3" id="text-org39f7f5c">
<p>
GitHubでのメタツールの作り方を解説している。
</p>

<ul class="org-ul">
<li>条件付きリクエストはレートを消費しない。変更がない場合は何も返さない</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org807515e" class="outline-2">
<h2 id="org807515e"><a href="#org807515e">Reference</a></h2>
<div class="outline-text-2" id="text-org807515e">
</div>
<div id="outline-container-org5d26551" class="outline-3">
<h3 id="org5d26551"><a href="#org5d26551"><a href="https://docs.github.com/ja">GitHub Documentation</a></a></h3>
<div class="outline-text-3" id="text-org5d26551">
<p>
GitHubのドキュメント。
</p>
</div>
</div>
</div>
<div id="outline-container-org5e15c79" class="outline-2">
<h2 id="org5e15c79"><a href="#org5e15c79">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
